<a href="https://colab.research.google.com/github/IvanLudvig/eggcounting/blob/master/eggcounting.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import json
from datetime import datetime
from urllib.request import urlopen

In [2]:
with urlopen('https://raw.githubusercontent.com/IvanLudvig/eggcounting/master/data/data1.json') as f:
    data = json.load(f)['messages']
    df = pd.DataFrame(data)

In [3]:
df

                        id     type  ... mentions reference
0       886460807087550536  Default  ...       []       NaN
1       886460808425537597  Default  ...       []       NaN
2       886460810455580732  Default  ...       []       NaN
3       886460811722227713  Default  ...       []       NaN
4       886460813790023730  Default  ...       []       NaN
...                    ...      ...  ...      ...       ...
102308  897490952921432084  Default  ...       []       NaN
102309  897490954813050880  Default  ...       []       NaN
102310  897490958873133086  Default  ...       []       NaN
102311  897490993539076136  Default  ...       []       NaN
102312  897491027982688348  Default  ...       []       NaN

[102313 rows x 13 columns]

In [4]:
df['user'] = df['author'].map(lambda x: x['name'])

In [5]:
df = df[['id', 'timestamp', 'content', 'user']]

filter only valid counts

In [6]:
df = df[df['content'].str.isnumeric()]

# Total counts

In [7]:
counts_df = df['user'].value_counts(sort=True).reset_index()
counts_df.columns = ['user', 'counts']

In [8]:
counts_df.index += 1
counts_df

                          user  counts
1                     Whit4You   38544
2   brainlet 🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚   36698
3               thelegendary08    6341
4                        const    3892
5        Pranoodles🍜 (she/her)    3804
6                       ob69jl    1715
7              country croocks    1610
8                      striker    1571
9               FortniteDude70     771
10                   Dawidluna     718
11                        core     511
12                        nodu     438
13                   blueisgod     347
14           purple [she/they]     296
15                      upvoid     260
16                        Keel     181
17                         0_0     109
18                  ben1996123     106
19                 Brendan7625     100
20                 DrToad866 🅱      60
21                  Lv.99 Kira      51
22         Grinch the mean one      34
23                  Trial-Name      17
24                         eff       4
25                      Solarϟ       2
26          anonymousdeveloper       2
27                     puds <3       1
28           GermanMgr14 [ARG]       1

# 1K days

In [9]:
df.head()

                   id                      timestamp content            user
0  886460807087550536  2021-09-12T03:58:46.055+00:00       1  thelegendary08
1  886460808425537597  2021-09-12T03:58:46.374+00:00       2  thelegendary08
2  886460810455580732  2021-09-12T03:58:46.858+00:00       3  thelegendary08
3  886460811722227713   2021-09-12T03:58:47.16+00:00       4  thelegendary08
4  886460813790023730  2021-09-12T03:58:47.653+00:00       5  thelegendary08

In [10]:
df['date'] = df['timestamp'].apply(lambda ts: ts.split('T')[0])

In [11]:
days_df = df[['user', 'date']]
days_df.head()

             user        date
0  thelegendary08  2021-09-12
1  thelegendary08  2021-09-12
2  thelegendary08  2021-09-12
3  thelegendary08  2021-09-12
4  thelegendary08  2021-09-12

In [12]:
group = days_df.groupby('user')
group = group.apply(lambda x: x['date'].to_numpy()).reset_index()
group.columns = ['user', 'dates']
group.head()

             user                                              dates
0             0_0  [2021-09-12, 2021-09-12, 2021-09-12, 2021-09-1...
1     Brendan7625  [2021-09-18, 2021-09-18, 2021-09-18, 2021-09-1...
2       Dawidluna  [2021-09-16, 2021-09-16, 2021-09-16, 2021-09-1...
3     DrToad866 🅱  [2021-10-03, 2021-10-03, 2021-10-03, 2021-10-0...
4  FortniteDude70  [2021-09-12, 2021-09-12, 2021-09-12, 2021-09-1...

In [13]:
for date in days_df['date'].unique():
    group[date] = group['dates'].map(lambda x: (x == date).sum())

In [14]:
group = group.drop(columns=['dates'])
group.head()

             user  2021-09-12  2021-09-13  ...  2021-10-10  2021-10-11  2021-10-12
0             0_0           5          47  ...           0           6           0
1     Brendan7625           0           0  ...           0           0           0
2       Dawidluna           0           0  ...           0           0           0
3     DrToad866 🅱           0           0  ...           0           0           0
4  FortniteDude70         115         180  ...          27           6          12

[5 rows x 32 columns]

In [15]:
counts = group.drop(columns=['user']).values

In [16]:
group['counts_list'] = counts.tolist()
group = group[['user', 'counts_list']]
group.head()

             user                                        counts_list
0             0_0  [5, 47, 0, 0, 0, 0, 0, 42, 8, 0, 0, 0, 0, 0, 1...
1     Brendan7625  [0, 0, 0, 0, 0, 0, 100, 0, 0, 0, 0, 0, 0, 0, 0...
2       Dawidluna  [0, 0, 0, 0, 200, 80, 0, 0, 0, 32, 0, 0, 0, 0,...
3     DrToad866 🅱  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...
4  FortniteDude70  [115, 180, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20...

### Total 1k days

In [17]:
group['1k_days'] = group['counts_list'].map(lambda x: (np.array(x) >= 1000).sum())
total_1kdays = group[['user', '1k_days']].sort_values(by='1k_days', ascending=False).reset_index(drop=True)
total_1kdays = total_1kdays[total_1kdays['1k_days']>0]

In [18]:
total_1kdays.index += 1
total_1kdays

                         user  1k_days
1                    Whit4You       14
2  brainlet 🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚       13
3              thelegendary08        1
4                      ob69jl        1
5                       const        1

## Max 1k streak

In [19]:
def get_max_streak(counts_list):
    bool_array = np.array(counts_list) >= 1000
    bool_array = np.split(bool_array, np.where(np.diff(bool_array) != 0)[0]+1)
    bool_array = list(filter(lambda x: x[0], bool_array))
    bool_array = [x.shape[0] for x in bool_array]
    return max(bool_array) if len(bool_array) > 0 else 0

In [20]:
group['max_streak'] = group['counts_list'].map(get_max_streak)

In [21]:
max_streak = group[['user', 'max_streak']].sort_values(by='max_streak', ascending=False).reset_index(drop=True)
max_streak = max_streak[max_streak['max_streak']>0]

In [22]:
max_streak.index += 1
max_streak

                         user  max_streak
1  brainlet 🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚🥚           6
2                    Whit4You           5
3              thelegendary08           1
4                      ob69jl           1
5                       const           1